# CannotCreateTaperedWallForWallTypeError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateTaperedWallForWallTypeError Property
BuiltInFailures..::..CreationFailures Class See Also
---
Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateTaperedWallForWallTypeError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateTaperedWallForWallTypeError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateTaperedWallForWallTypeError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace